public class Main {
    public static void main(String[] args) {
        /**Получить исходную json строку из файла, используя FileReader или Scanner
         Дана json строка вида:
         String json = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}," +
         "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"}," +
         "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";

         Задача написать метод(ы), который распарсить строку и выдаст ответ вида:
         Студент Иванов получил 5 по предмету Математика.
         Студент Петрова получил 4 по предмету Информатика.
         Студент Краснов получил 5 по предмету Физика.

         Используйте StringBuilder для подготовки ответа. Далее создайте метод, который запишет
         результат работы в файл. Обработайте исключения и запишите ошибки в лог файл с помощью Logger.*/


        String json = "[{\"фамилия\":\"Иванов\",\"оценка\":\"5\",\"предмет\":\"Математика\"}," +
                "{\"фамилия\":\"Петрова\",\"оценка\":\"4\",\"предмет\":\"Информатика\"}," +
                "{\"фамилия\":\"Краснов\",\"оценка\":\"5\",\"предмет\":\"Физика\"}]";

        json = json.replace
                ("[", "").replace
                ("]", "").replace
                ("{", "").replace
                ("}", "").replace
                ("\\", "").replace
                ('"', ' ');


        String[] result = json.split(",");
        String[] res = new String[result.length];
        int j = 0;

        for (String pair : result) {
            pair = pair.replace(" ", "");
            pair = pair.substring(pair.indexOf(":") + 1);
            res[j] = pair;
            j++;
        }

        int i = 0;
        while (i < res.length) {
            System.out.printf("Студент " + res[i] + " получил " + res[i + 1] + " по предмету " + res[i + 2] + ".");
            System.out.println();
            i += 3;
        }

        writeToFile.write(res);
    }
}